; ModuleID = 'eval_aesni256gcm_encrypt.c'
source_filename = "eval_aesni256gcm_encrypt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [145 x i8] c"Usage: %s <num_benchmark_iterations> <num_warmup_iterations> <message> <size_of_associated_data> <cycle_counts_file> [<dynamic_hitcounts_file>]\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"Error initializing lib sodium\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [125 x i8] c"(sodium_init_success == sodium_init_result || sodium_already_initd == sodium_init_result) && \22Error initializing lib sodium\22\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [27 x i8] c"eval_aesni256gcm_encrypt.c\00", align 1, !dbg !17
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [23 x i8] c"int main(int, char **)\00", align 1, !dbg !22
@.str.4 = private unnamed_addr constant [68 x i8] c"Couldn't allocate decrypted_msg bytes in eval_aesni256gcm_encrypt.c\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [87 x i8] c"decrypted_msg && \22Couldn't allocate decrypted_msg bytes in eval_aesni256gcm_encrypt.c\22\00", align 1, !dbg !33
@.str.6 = private unnamed_addr constant [65 x i8] c"Couldn't allocate ciphertext bytes in eval_aesni256gcm_encrypt.c\00", align 1, !dbg !38

!244 = !DILocalVariable(name: "_eval_cycles_low", scope: !245, file: !2, line: 137, type: !246)
!245 = distinct !DILexicalBlock(scope: !240, file: !2, line: 137, column: 18)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !119, line: 26, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !121, line: 42, baseType: !248)
!248 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!249 = !DILocation(line: 137, column: 18, scope: !245)
!250 = !DILocalVariable(name: "_eval_cycles_high", scope: !245, file: !2, line: 137, type: !246)
!251 = !{i64 2147804841, i64 2147804849, i64 2147804874, i64 2147804919, i64 2147804960}
!252 = !DILocation(line: 137, column: 16, scope: !240)
!253 = !DILocalVariable(name: "encrypt_result", scope: !240, file: !2, line: 140, type: !134)
!254 = !DILocation(line: 140, column: 9, scope: !240)
!255 = !DILocation(line: 140, column: 56, scope: !240)
!256 = !DILocation(line: 141, column: 11, scope: !240)
!257 = !DILocation(line: 141, column: 16, scope: !240)
!258 = !DILocation(line: 141, column: 24, scope: !240)
!259 = !DILocation(line: 141, column: 41, scope: !240)
!260 = !DILocation(line: 141, column: 67, scope: !240)
!261 = !DILocation(line: 141, column: 74, scope: !240)
!262 = !DILocation(line: 140, column: 26, scope: !240)
!263 = !DILocalVariable(name: "_eval_cycles_low", scope: !264, file: !2, line: 144, type: !246)
!264 = distinct !DILexicalBlock(scope: !240, file: !2, line: 144, column: 16)
!265 = !DILocation(line: 144, column: 16, scope: !264)
!266 = !DILocalVariable(name: "_eval_cycles_high", scope: !264, file: !2, line: 144, type: !246)
!267 = !{i64 2147805350, i64 2147805359, i64 2147805459, i64 2147805539, i64 2147805601}
!268 = !DILocation(line: 144, column: 14, scope: !240)
!269 = !DILocation(line: 146, column: 15, scope: !270)
!270 = distinct !DILexicalBlock(scope: !240, file: !2, line: 146, column: 9)
!271 = !DILocation(line: 146, column: 12, scope: !270)
!272 = !DILocation(line: 147, column: 7, scope: !273)
!273 = distinct !DILexicalBlock(scope: !270, file: !2, line: 146, column: 31)
!274 = !DILocation(line: 148, column: 7, scope: !273)
!275 = !DILocation(line: 151, column: 9, scope: !276)
!276 = distinct !DILexicalBlock(scope: !240, file: !2, line: 151, column: 9)
!277 = !DILocation(line: 151, column: 21, scope: !276)
!278 = !DILocation(line: 151, column: 18, scope: !276)
!279 = !DILocation(line: 152, column: 38, scope: !280)
!280 = distinct !DILexicalBlock(scope: !276, file: !2, line: 151, column: 33)
!281 = !DILocation(line: 152, column: 49, scope: !280)
!282 = !DILocation(line: 152, column: 47, scope: !280)
!283 = !DILocation(line: 152, column: 7, scope: !280)
!284 = !DILocation(line: 152, column: 13, scope: !280)
!285 = !DILocation(line: 152, column: 24, scope: !280)
!286 = !DILocation(line: 152, column: 22, scope: !280)
!287 = !DILocation(line: 152, column: 36, scope: !280)
!288 = !DILocation(line: 153, column: 5, scope: !280)
!289 = !DILocalVariable(name: "decrypt_result", scope: !240, file: !2, line: 156, type: !134)
!290 = !DILocation(line: 156, column: 9, scope: !240)
!291 = !DILocation(line: 156, column: 56, scope: !240)
!292 = !DILocation(line: 157, column: 17, scope: !240)
!293 = !DILocation(line: 157, column: 29, scope: !240)
!294 = !DILocation(line: 157, column: 44, scope: !240)
!295 = !DILocation(line: 157, column: 61, scope: !240)
!296 = !DILocation(line: 158, column: 11, scope: !240)
!297 = !DILocation(line: 158, column: 18, scope: !240)
!298 = !DILocation(line: 156, column: 26, scope: !240)
!299 = !DILocation(line: 160, column: 15, scope: !300)
!300 = distinct !DILexicalBlock(scope: !240, file: !2, line: 160, column: 9)
!301 = !DILocation(line: 160, column: 12, scope: !300)
!302 = !DILocation(line: 161, column: 7, scope: !303)
!303 = distinct !DILexicalBlock(scope: !300, file: !2, line: 160, column: 31)
!304 = !DILocation(line: 162, column: 7, scope: !303)
!305 = !DILocalVariable(name: "cmp_result", scope: !240, file: !2, line: 165, type: !134)
!306 = !DILocation(line: 165, column: 9, scope: !240)
!307 = !DILocation(line: 165, column: 29, scope: !240)
!308 = !DILocation(line: 165, column: 34, scope: !240)
!309 = !DILocation(line: 165, column: 49, scope: !240)
!310 = !DILocation(line: 165, column: 22, scope: !240)
!311 = !DILocation(line: 166, column: 14, scope: !312)
!312 = distinct !DILexicalBlock(scope: !240, file: !2, line: 166, column: 9)
!313 = !DILocation(line: 166, column: 11, scope: !312)
!314 = !DILocation(line: 167, column: 7, scope: !315)
!315 = distinct !DILexicalBlock(scope: !312, file: !2, line: 166, column: 26)
!316 = !DILocation(line: 168, column: 7, scope: !315)
!317 = !DILocation(line: 170, column: 3, scope: !240)
!318 = !DILocation(line: 130, column: 60, scope: !233)
!319 = !DILocation(line: 130, column: 3, scope: !233)
!320 = distinct !{!320, !238, !321, !322}
!321 = !DILocation(line: 170, column: 3, scope: !229)
!322 = !{!"llvm.loop.mustprogress"}
!323 = !DILocalVariable(name: "ccounts_out", scope: !131, file: !2, line: 174, type: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !326, line: 7, baseType: !327)
!326 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !328, line: 49, size: 1728, elements: !329)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !345, !347, !348, !349, !352, !354, !356, !360, !363, !365, !368, !371, !372, !373, !376, !377}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !327, file: !328, line: 51, baseType: !134, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !327, file: !328, line: 54, baseType: !114, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !327, file: !328, line: 55, baseType: !114, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !327, file: !328, line: 56, baseType: !114, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !327, file: !328, line: 57, baseType: !114, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !327, file: !328, line: 58, baseType: !114, size: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !327, file: !328, line: 59, baseType: !114, size: 64, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !327, file: !328, line: 60, baseType: !114, size: 64, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !327, file: !328, line: 61, baseType: !114, size: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !327, file: !328, line: 64, baseType: !114, size: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !327, file: !328, line: 65, baseType: !114, size: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !327, file: !328, line: 66, baseType: !114, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !327, file: !328, line: 68, baseType: !343, size: 64, offset: 768)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !328, line: 36, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !327, file: !328, line: 70, baseType: !346, size: 64, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !327, file: !328, line: 72, baseType: !134, size: 32, offset: 896)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !327, file: !328, line: 73, baseType: !134, size: 32, offset: 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !327, file: !328, line: 74, baseType: !350, size: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !121, line: 152, baseType: !351)
!351 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !327, file: !328, line: 77, baseType: !353, size: 16, offset: 1024)
!353 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !327, file: !328, line: 78, baseType: !355, size: 8, offset: 1040)
!355 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !327, file: !328, line: 79, baseType: !357, size: 8, offset: 1048)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 1)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !327, file: !328, line: 81, baseType: !361, size: 64, offset: 1088)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !328, line: 43, baseType: null)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !327, file: !328, line: 89, baseType: !364, size: 64, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !121, line: 153, baseType: !351)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !327, file: !328, line: 91, baseType: !366, size: 64, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !328, line: 37, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !327, file: !328, line: 92, baseType: !369, size: 64, offset: 1280)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !328, line: 38, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !327, file: !328, line: 93, baseType: !346, size: 64, offset: 1344)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !327, file: !328, line: 94, baseType: !115, size: 64, offset: 1408)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !327, file: !328, line: 95, baseType: !374, size: 64, offset: 1472)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !375, line: 18, baseType: !122)
!375 = !DIFile(filename: "build/lib/clang/22/include/__stddef_size_t.h", directory: "/home/rgangar/Documents/llvm-data-independent-timing", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !327, file: !328, line: 96, baseType: !134, size: 32, offset: 1536)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !327, file: !328, line: 98, baseType: !378, size: 160, offset: 1568)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 20)
!381 = !DILocation(line: 174, column: 9, scope: !131)
!382 = !DILocation(line: 174, column: 29, scope: !131)
!383 = !DILocation(line: 174, column: 23, scope: !131)
!384 = !DILocation(line: 175, column: 10, scope: !131)
!385 = !DILocation(line: 175, column: 22, scope: !131)
!386 = !DILocation(line: 175, column: 30, scope: !131)
!387 = !DILocation(line: 175, column: 3, scope: !131)
!388 = !DILocation(line: 177, column: 11, scope: !131)
!389 = !DILocation(line: 179, column: 4, scope: !131)
!390 = !DILocation(line: 179, column: 14, scope: !131)
!391 = !DILocation(line: 177, column: 3, scope: !131)
!392 = !DILocalVariable(name: "ii", scope: !393, file: !2, line: 181, type: !134)
!393 = distinct !DILexicalBlock(scope: !131, file: !2, line: 181, column: 3)
!394 = !DILocation(line: 181, column: 12, scope: !393)
!395 = !DILocation(line: 181, column: 8, scope: !393)
!396 = !DILocation(line: 181, column: 20, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !2, line: 181, column: 3)
!398 = !DILocation(line: 181, column: 25, scope: !397)
!399 = !DILocation(line: 181, column: 23, scope: !397)
!400 = !DILocation(line: 181, column: 3, scope: !393)
!401 = !DILocation(line: 182, column: 12, scope: !402)
!402 = distinct !DILexicalBlock(scope: !397, file: !2, line: 181, column: 41)
!403 = !DILocation(line: 182, column: 42, scope: !402)
!404 = !DILocation(line: 182, column: 48, scope: !402)
!405 = !DILocation(line: 182, column: 4, scope: !402)
!406 = !DILocation(line: 183, column: 3, scope: !402)
!407 = !DILocation(line: 181, column: 35, scope: !397)
!408 = !DILocation(line: 181, column: 3, scope: !397)
!409 = distinct !{!409, !400, !410, !322}
!410 = !DILocation(line: 183, column: 3, scope: !393)
!411 = !DILocation(line: 184, column: 17, scope: !131)
!412 = !DILocation(line: 184, column: 10, scope: !131)
!413 = !DILocation(line: 184, column: 30, scope: !131)
!414 = !DILocation(line: 184, column: 37, scope: !131)
!415 = !DILocation(line: 184, column: 3, scope: !131)
!416 = !DILocation(line: 193, column: 3, scope: !131)
