; ModuleID = 'eval_chacha20_poly1305_decrypt.c'
source_filename = "eval_chacha20_poly1305_decrypt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [145 x i8] c"Usage: %s <num_benchmark_iterations> <num_warmup_iterations> <message> <size_of_associated_data> <cycle_counts_file> [<dynamic_hitcounts_file>]\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"Error initializing lib sodium\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [125 x i8] c"(sodium_init_success == sodium_init_result || sodium_already_initd == sodium_init_result) && \22Error initializing lib sodium\22\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [33 x i8] c"eval_chacha20_poly1305_decrypt.c\00", align 1, !dbg !17
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [23 x i8] c"int main(int, char **)\00", align 1, !dbg !22
@.str.4 = private unnamed_addr constant [71 x i8] c"Couldn't allocate opened_msg bytes in eval_chacha20-poly1305-decrypt.c\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [87 x i8] c"opened_msg && \22Couldn't allocate opened_msg bytes in eval_chacha20-poly1305-decrypt.c\22\00", align 1, !dbg !33
@.str.6 = private unnamed_addr constant [71 x i8] c"Couldn't allocate signed msg bytes in eval_chacha20-poly1305-decrypt.c\00", align 1, !dbg !38

!280 = !DILocation(line: 142, column: 5, scope: !277)
!281 = !DILocalVariable(name: "encrypt_result", scope: !277, file: !2, line: 144, type: !139)
!282 = !DILocation(line: 144, column: 9, scope: !277)
!283 = !DILocation(line: 145, column: 28, scope: !277)
!284 = !DILocation(line: 147, column: 21, scope: !277)
!285 = !DILocation(line: 148, column: 20, scope: !277)
!286 = !DILocation(line: 149, column: 29, scope: !277)
!287 = !DILocation(line: 150, column: 32, scope: !277)
!288 = !DILocation(line: 150, column: 58, scope: !277)
!289 = !DILocation(line: 150, column: 65, scope: !277)
!290 = !DILocation(line: 144, column: 26, scope: !277)
!291 = !DILocation(line: 152, column: 15, scope: !292)
!292 = distinct !DILexicalBlock(scope: !277, file: !2, line: 152, column: 9)
!293 = !DILocation(line: 152, column: 12, scope: !292)
!294 = !DILocation(line: 153, column: 7, scope: !295)
!295 = distinct !DILexicalBlock(scope: !292, file: !2, line: 152, column: 31)
!296 = !DILocation(line: 154, column: 7, scope: !295)
!297 = !DILocalVariable(name: "_eval_cycles_low", scope: !298, file: !2, line: 158, type: !299)
!298 = distinct !DILexicalBlock(scope: !277, file: !2, line: 158, column: 18)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !124, line: 26, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !126, line: 42, baseType: !301)
!301 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!302 = !DILocation(line: 158, column: 18, scope: !298)
!303 = !DILocalVariable(name: "_eval_cycles_high", scope: !298, file: !2, line: 158, type: !299)
!304 = !{i64 2147805246, i64 2147805254, i64 2147805279, i64 2147805324, i64 2147805365}
!305 = !DILocation(line: 158, column: 16, scope: !277)
!306 = !DILocalVariable(name: "decrypt_result", scope: !277, file: !2, line: 160, type: !139)
!307 = !DILocation(line: 160, column: 9, scope: !277)
!308 = !DILocation(line: 161, column: 20, scope: !277)
!309 = !DILocation(line: 162, column: 20, scope: !277)
!310 = !DILocation(line: 163, column: 14, scope: !277)
!311 = !DILocation(line: 163, column: 29, scope: !277)
!312 = !DILocation(line: 164, column: 14, scope: !277)
!313 = !DILocation(line: 165, column: 14, scope: !277)
!314 = !DILocation(line: 165, column: 21, scope: !277)
!315 = !DILocation(line: 160, column: 26, scope: !277)
!316 = !DILocalVariable(name: "_eval_cycles_low", scope: !317, file: !2, line: 168, type: !299)
!317 = distinct !DILexicalBlock(scope: !277, file: !2, line: 168, column: 16)
!318 = !DILocation(line: 168, column: 16, scope: !317)
!319 = !DILocalVariable(name: "_eval_cycles_high", scope: !317, file: !2, line: 168, type: !299)
!320 = !{i64 2147805755, i64 2147805764, i64 2147805864, i64 2147805944, i64 2147806006}
!321 = !DILocation(line: 168, column: 14, scope: !277)
!322 = !DILocation(line: 170, column: 15, scope: !323)
!323 = distinct !DILexicalBlock(scope: !277, file: !2, line: 170, column: 9)
!324 = !DILocation(line: 170, column: 12, scope: !323)
!325 = !DILocation(line: 171, column: 7, scope: !326)
!326 = distinct !DILexicalBlock(scope: !323, file: !2, line: 170, column: 31)
!327 = !DILocation(line: 172, column: 7, scope: !326)
!328 = !DILocation(line: 175, column: 9, scope: !329)
!329 = distinct !DILexicalBlock(scope: !277, file: !2, line: 175, column: 9)
!330 = !DILocation(line: 175, column: 21, scope: !329)
!331 = !DILocation(line: 175, column: 18, scope: !329)
!332 = !DILocation(line: 176, column: 38, scope: !333)
!333 = distinct !DILexicalBlock(scope: !329, file: !2, line: 175, column: 33)
!334 = !DILocation(line: 176, column: 49, scope: !333)
!335 = !DILocation(line: 176, column: 47, scope: !333)
!336 = !DILocation(line: 176, column: 7, scope: !333)
!337 = !DILocation(line: 176, column: 13, scope: !333)
!338 = !DILocation(line: 176, column: 24, scope: !333)
!339 = !DILocation(line: 176, column: 22, scope: !333)
!340 = !DILocation(line: 176, column: 36, scope: !333)
!341 = !DILocation(line: 177, column: 5, scope: !333)
!342 = !DILocalVariable(name: "cmp_result", scope: !277, file: !2, line: 179, type: !139)
!343 = !DILocation(line: 179, column: 9, scope: !277)
!344 = !DILocation(line: 179, column: 29, scope: !277)
!345 = !DILocation(line: 179, column: 34, scope: !277)
!346 = !DILocation(line: 179, column: 49, scope: !277)
!347 = !DILocation(line: 179, column: 22, scope: !277)
!348 = !DILocation(line: 180, column: 14, scope: !349)
!349 = distinct !DILexicalBlock(scope: !277, file: !2, line: 180, column: 9)
!350 = !DILocation(line: 180, column: 11, scope: !349)
!351 = !DILocation(line: 181, column: 7, scope: !352)
!352 = distinct !DILexicalBlock(scope: !349, file: !2, line: 180, column: 26)
!353 = !DILocation(line: 182, column: 7, scope: !352)
!354 = !DILocation(line: 184, column: 3, scope: !277)
!355 = !DILocation(line: 137, column: 60, scope: !270)
!356 = !DILocation(line: 137, column: 3, scope: !270)
!357 = distinct !{!357, !275, !358, !164}
!358 = !DILocation(line: 184, column: 3, scope: !266)
!359 = !DILocalVariable(name: "ccounts_out", scope: !166, file: !2, line: 187, type: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !362, line: 7, baseType: !363)
!362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !364, line: 49, size: 1728, elements: !365)
!364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !381, !383, !384, !385, !388, !390, !392, !396, !399, !401, !404, !407, !408, !409, !412, !413}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !363, file: !364, line: 51, baseType: !139, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !363, file: !364, line: 54, baseType: !119, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !363, file: !364, line: 55, baseType: !119, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !363, file: !364, line: 56, baseType: !119, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !363, file: !364, line: 57, baseType: !119, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !363, file: !364, line: 58, baseType: !119, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !363, file: !364, line: 59, baseType: !119, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !363, file: !364, line: 60, baseType: !119, size: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !363, file: !364, line: 61, baseType: !119, size: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !363, file: !364, line: 64, baseType: !119, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !363, file: !364, line: 65, baseType: !119, size: 64, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !363, file: !364, line: 66, baseType: !119, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !363, file: !364, line: 68, baseType: !379, size: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !364, line: 36, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !363, file: !364, line: 70, baseType: !382, size: 64, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !363, file: !364, line: 72, baseType: !139, size: 32, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !363, file: !364, line: 73, baseType: !139, size: 32, offset: 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !363, file: !364, line: 74, baseType: !386, size: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !126, line: 152, baseType: !387)
!387 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !363, file: !364, line: 77, baseType: !389, size: 16, offset: 1024)
!389 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !363, file: !364, line: 78, baseType: !391, size: 8, offset: 1040)
!391 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !363, file: !364, line: 79, baseType: !393, size: 8, offset: 1048)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 1)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !363, file: !364, line: 81, baseType: !397, size: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !364, line: 43, baseType: null)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !363, file: !364, line: 89, baseType: !400, size: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !126, line: 153, baseType: !387)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !363, file: !364, line: 91, baseType: !402, size: 64, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !364, line: 37, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !363, file: !364, line: 92, baseType: !405, size: 64, offset: 1280)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !364, line: 38, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !363, file: !364, line: 93, baseType: !382, size: 64, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !363, file: !364, line: 94, baseType: !120, size: 64, offset: 1408)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !363, file: !364, line: 95, baseType: !410, size: 64, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !411, line: 18, baseType: !127)
!411 = !DIFile(filename: "build/lib/clang/22/include/__stddef_size_t.h", directory: "/home/rgangar/Documents/llvm-data-independent-timing", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !363, file: !364, line: 96, baseType: !139, size: 32, offset: 1536)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !363, file: !364, line: 98, baseType: !414, size: 160, offset: 1568)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 20)
!417 = !DILocation(line: 187, column: 9, scope: !166)
!418 = !DILocation(line: 187, column: 29, scope: !166)
!419 = !DILocation(line: 187, column: 23, scope: !166)
!420 = !DILocation(line: 188, column: 10, scope: !166)
!421 = !DILocation(line: 188, column: 22, scope: !166)
!422 = !DILocation(line: 188, column: 30, scope: !166)
!423 = !DILocation(line: 188, column: 3, scope: !166)
!424 = !DILocation(line: 190, column: 11, scope: !166)
!425 = !DILocation(line: 192, column: 4, scope: !166)
!426 = !DILocation(line: 192, column: 14, scope: !166)
!427 = !DILocation(line: 190, column: 3, scope: !166)
!428 = !DILocalVariable(name: "ii", scope: !429, file: !2, line: 193, type: !139)
!429 = distinct !DILexicalBlock(scope: !166, file: !2, line: 193, column: 3)
!430 = !DILocation(line: 193, column: 12, scope: !429)
!431 = !DILocation(line: 193, column: 8, scope: !429)
!432 = !DILocation(line: 193, column: 20, scope: !433)
!433 = distinct !DILexicalBlock(scope: !429, file: !2, line: 193, column: 3)
!434 = !DILocation(line: 193, column: 25, scope: !433)
!435 = !DILocation(line: 193, column: 23, scope: !433)
!436 = !DILocation(line: 193, column: 3, scope: !429)
!437 = !DILocation(line: 194, column: 12, scope: !438)
!438 = distinct !DILexicalBlock(scope: !433, file: !2, line: 193, column: 41)
!439 = !DILocation(line: 194, column: 42, scope: !438)
!440 = !DILocation(line: 194, column: 48, scope: !438)
!441 = !DILocation(line: 194, column: 4, scope: !438)
!442 = !DILocation(line: 195, column: 3, scope: !438)
!443 = !DILocation(line: 193, column: 35, scope: !433)
!444 = !DILocation(line: 193, column: 3, scope: !433)
!445 = distinct !{!445, !436, !446, !164}
!446 = !DILocation(line: 195, column: 3, scope: !429)
!447 = !DILocation(line: 196, column: 17, scope: !166)
!448 = !DILocation(line: 196, column: 10, scope: !166)
!449 = !DILocation(line: 196, column: 30, scope: !166)
!450 = !DILocation(line: 196, column: 37, scope: !166)
!451 = !DILocation(line: 196, column: 3, scope: !166)
!452 = !DILocation(line: 205, column: 3, scope: !166)
