; ModuleID = 'eval_argon2id.c'
source_filename = "eval_argon2id.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [154 x i8] c"Usage: %s <num_benchmark_iterations> <num_warmup_iterations> <password> <size_of_output> <file_to_write_cycle_counts_to> [<file_to_write_hit_counts_to>]\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"Error initializing lib sodium\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [125 x i8] c"(sodium_init_success == sodium_init_result || sodium_already_initd == sodium_init_result) && \22Error initializing lib sodium\22\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [16 x i8] c"eval_argon2id.c\00", align 1, !dbg !17
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [23 x i8] c"int main(int, char **)\00", align 1, !dbg !22
@.str.4 = private unnamed_addr constant [50 x i8] c"Password size is less than min in eval_argon2id.c\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [95 x i8] c"passwd_sz >= crypto_pwhash_passwd_min() && \22Password size is less than min in eval_argon2id.c\22\00", align 1, !dbg !33
@.str.6 = private unnamed_addr constant [53 x i8] c"Password size is greater than max in eval_argon2id.c\00", align 1, !dbg !38

!241 = !DILocalVariable(name: "alg", scope: !150, file: !2, line: 120, type: !153)
!242 = !DILocation(line: 120, column: 7, scope: !150)
!243 = !DILocation(line: 120, column: 13, scope: !150)
!244 = !DILocalVariable(name: "times", scope: !150, file: !2, line: 123, type: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!246 = !DILocation(line: 123, column: 13, scope: !150)
!247 = !DILocation(line: 123, column: 28, scope: !150)
!248 = !DILocation(line: 123, column: 21, scope: !150)
!249 = !DILocation(line: 124, column: 10, scope: !150)
!250 = !DILocation(line: 124, column: 16, scope: !150)
!251 = !DILocation(line: 124, column: 3, scope: !150)
!252 = !DILocalVariable(name: "start_time", scope: !150, file: !2, line: 127, type: !253)
!253 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!254 = !DILocation(line: 127, column: 21, scope: !150)
!255 = !DILocalVariable(name: "end_time", scope: !150, file: !2, line: 128, type: !253)
!256 = !DILocation(line: 128, column: 21, scope: !150)
!257 = !DILocalVariable(name: "cur_iter", scope: !258, file: !2, line: 131, type: !153)
!258 = distinct !DILexicalBlock(scope: !150, file: !2, line: 131, column: 3)
!259 = !DILocation(line: 131, column: 12, scope: !258)
!260 = !DILocation(line: 131, column: 8, scope: !258)
!261 = !DILocation(line: 131, column: 26, scope: !262)
!262 = distinct !DILexicalBlock(scope: !258, file: !2, line: 131, column: 3)
!263 = !DILocation(line: 131, column: 37, scope: !262)
!264 = !DILocation(line: 131, column: 48, scope: !262)
!265 = !DILocation(line: 131, column: 46, scope: !262)
!266 = !DILocation(line: 131, column: 35, scope: !262)
!267 = !DILocation(line: 131, column: 3, scope: !258)
!268 = !DILocation(line: 133, column: 21, scope: !269)
!269 = distinct !DILexicalBlock(scope: !262, file: !2, line: 131, column: 72)
!270 = !DILocation(line: 133, column: 5, scope: !269)
!271 = !DILocalVariable(name: "_eval_cycles_low", scope: !272, file: !2, line: 136, type: !273)
!272 = distinct !DILexicalBlock(scope: !269, file: !2, line: 136, column: 18)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !137, line: 26, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !139, line: 42, baseType: !275)
!275 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!276 = !DILocation(line: 136, column: 18, scope: !272)
!277 = !DILocalVariable(name: "_eval_cycles_high", scope: !272, file: !2, line: 136, type: !273)
!278 = !{i64 2147804546, i64 2147804554, i64 2147804579, i64 2147804624, i64 2147804665}
!279 = !DILocation(line: 136, column: 16, scope: !269)
!280 = !DILocalVariable(name: "pwhash_result", scope: !269, file: !2, line: 139, type: !153)
!281 = !DILocation(line: 139, column: 9, scope: !269)
!282 = !DILocation(line: 139, column: 39, scope: !269)
!283 = !DILocation(line: 139, column: 44, scope: !269)
!284 = !DILocation(line: 139, column: 65, scope: !269)
!285 = !DILocation(line: 139, column: 73, scope: !269)
!286 = !DILocation(line: 140, column: 11, scope: !269)
!287 = !DILocation(line: 140, column: 17, scope: !269)
!288 = !DILocation(line: 140, column: 27, scope: !269)
!289 = !DILocation(line: 140, column: 37, scope: !269)
!290 = !DILocation(line: 139, column: 25, scope: !269)
!291 = !DILocalVariable(name: "_eval_cycles_low", scope: !292, file: !2, line: 143, type: !273)
!292 = distinct !DILexicalBlock(scope: !269, file: !2, line: 143, column: 16)
!293 = !DILocation(line: 143, column: 16, scope: !292)
!294 = !DILocalVariable(name: "_eval_cycles_high", scope: !292, file: !2, line: 143, type: !273)
!295 = !{i64 2147805044, i64 2147805053, i64 2147805153, i64 2147805233, i64 2147805295}
!296 = !DILocation(line: 143, column: 14, scope: !269)
!297 = !DILocation(line: 145, column: 18, scope: !269)
!298 = !DILocation(line: 145, column: 15, scope: !269)
!299 = !DILocation(line: 145, column: 5, scope: !269)
!300 = !DILocation(line: 147, column: 9, scope: !301)
!301 = distinct !DILexicalBlock(scope: !269, file: !2, line: 147, column: 9)
!302 = !DILocation(line: 147, column: 21, scope: !301)
!303 = !DILocation(line: 147, column: 18, scope: !301)
!304 = !DILocation(line: 148, column: 38, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !2, line: 147, column: 33)
!306 = !DILocation(line: 148, column: 49, scope: !305)
!307 = !DILocation(line: 148, column: 47, scope: !305)
!308 = !DILocation(line: 148, column: 7, scope: !305)
!309 = !DILocation(line: 148, column: 13, scope: !305)
!310 = !DILocation(line: 148, column: 24, scope: !305)
!311 = !DILocation(line: 148, column: 22, scope: !305)
!312 = !DILocation(line: 148, column: 36, scope: !305)
!313 = !DILocation(line: 149, column: 5, scope: !305)
!314 = !DILocation(line: 152, column: 3, scope: !269)
!315 = !DILocation(line: 131, column: 60, scope: !262)
!316 = !DILocation(line: 131, column: 3, scope: !262)
!317 = distinct !{!317, !267, !318, !319}
!318 = !DILocation(line: 152, column: 3, scope: !258)
!319 = !{!"llvm.loop.mustprogress"}
!320 = !DILocalVariable(name: "ccounts_out", scope: !150, file: !2, line: 155, type: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !323, line: 7, baseType: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !325, line: 49, size: 1728, elements: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !342, !344, !345, !346, !349, !351, !353, !357, !360, !362, !365, !368, !369, !370, !373, !374}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !324, file: !325, line: 51, baseType: !153, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !324, file: !325, line: 54, baseType: !132, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !324, file: !325, line: 55, baseType: !132, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !324, file: !325, line: 56, baseType: !132, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !324, file: !325, line: 57, baseType: !132, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !324, file: !325, line: 58, baseType: !132, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !324, file: !325, line: 59, baseType: !132, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !324, file: !325, line: 60, baseType: !132, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !324, file: !325, line: 61, baseType: !132, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !324, file: !325, line: 64, baseType: !132, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !324, file: !325, line: 65, baseType: !132, size: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !324, file: !325, line: 66, baseType: !132, size: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !324, file: !325, line: 68, baseType: !340, size: 64, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !325, line: 36, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !324, file: !325, line: 70, baseType: !343, size: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !324, file: !325, line: 72, baseType: !153, size: 32, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !324, file: !325, line: 73, baseType: !153, size: 32, offset: 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !324, file: !325, line: 74, baseType: !347, size: 64, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !139, line: 152, baseType: !348)
!348 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !324, file: !325, line: 77, baseType: !350, size: 16, offset: 1024)
!350 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !324, file: !325, line: 78, baseType: !352, size: 8, offset: 1040)
!352 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !324, file: !325, line: 79, baseType: !354, size: 8, offset: 1048)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 1)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !324, file: !325, line: 81, baseType: !358, size: 64, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !325, line: 43, baseType: null)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !324, file: !325, line: 89, baseType: !361, size: 64, offset: 1152)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !139, line: 153, baseType: !348)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !324, file: !325, line: 91, baseType: !363, size: 64, offset: 1216)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !325, line: 37, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !324, file: !325, line: 92, baseType: !366, size: 64, offset: 1280)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !325, line: 38, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !324, file: !325, line: 93, baseType: !343, size: 64, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !324, file: !325, line: 94, baseType: !133, size: 64, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !324, file: !325, line: 95, baseType: !371, size: 64, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !372, line: 18, baseType: !140)
!372 = !DIFile(filename: "build/lib/clang/22/include/__stddef_size_t.h", directory: "/home/rgangar/Documents/llvm-data-independent-timing", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !324, file: !325, line: 96, baseType: !153, size: 32, offset: 1536)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !324, file: !325, line: 98, baseType: !94, size: 160, offset: 1568)
!375 = !DILocation(line: 155, column: 9, scope: !150)
!376 = !DILocation(line: 155, column: 29, scope: !150)
!377 = !DILocation(line: 155, column: 23, scope: !150)
!378 = !DILocation(line: 156, column: 10, scope: !150)
!379 = !DILocation(line: 156, column: 22, scope: !150)
!380 = !DILocation(line: 156, column: 30, scope: !150)
!381 = !DILocation(line: 156, column: 3, scope: !150)
!382 = !DILocation(line: 158, column: 11, scope: !150)
!383 = !DILocation(line: 160, column: 4, scope: !150)
!384 = !DILocation(line: 160, column: 14, scope: !150)
!385 = !DILocation(line: 158, column: 3, scope: !150)
!386 = !DILocalVariable(name: "ii", scope: !387, file: !2, line: 161, type: !153)
!387 = distinct !DILexicalBlock(scope: !150, file: !2, line: 161, column: 3)
!388 = !DILocation(line: 161, column: 12, scope: !387)
!389 = !DILocation(line: 161, column: 8, scope: !387)
!390 = !DILocation(line: 161, column: 20, scope: !391)
!391 = distinct !DILexicalBlock(scope: !387, file: !2, line: 161, column: 3)
!392 = !DILocation(line: 161, column: 25, scope: !391)
!393 = !DILocation(line: 161, column: 23, scope: !391)
!394 = !DILocation(line: 161, column: 3, scope: !387)
!395 = !DILocation(line: 162, column: 12, scope: !396)
!396 = distinct !DILexicalBlock(scope: !391, file: !2, line: 161, column: 41)
!397 = !DILocation(line: 162, column: 42, scope: !396)
!398 = !DILocation(line: 162, column: 48, scope: !396)
!399 = !DILocation(line: 162, column: 4, scope: !396)
!400 = !DILocation(line: 163, column: 3, scope: !396)
!401 = !DILocation(line: 161, column: 35, scope: !391)
!402 = !DILocation(line: 161, column: 3, scope: !391)
!403 = distinct !{!403, !394, !404, !319}
!404 = !DILocation(line: 163, column: 3, scope: !387)
!405 = !DILocation(line: 164, column: 17, scope: !150)
!406 = !DILocation(line: 164, column: 10, scope: !150)
!407 = !DILocation(line: 164, column: 30, scope: !150)
!408 = !DILocation(line: 164, column: 37, scope: !150)
!409 = !DILocation(line: 164, column: 3, scope: !150)
!410 = !DILocation(line: 173, column: 3, scope: !150)
