; ModuleID = 'eval_aesni256gcm_decrypt.c'
source_filename = "eval_aesni256gcm_decrypt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [146 x i8] c"Usage: %s <num_benchmark_iterations> <num_warmup_iterations> <messagee> <size_of_associated_data> <cycle_counts_file> [<dynamic_hitcounts_file>]\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"Error initializing lib sodium\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [125 x i8] c"(sodium_init_success == sodium_init_result || sodium_already_initd == sodium_init_result) && \22Error initializing lib sodium\22\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [27 x i8] c"eval_aesni256gcm_decrypt.c\00", align 1, !dbg !17
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [23 x i8] c"int main(int, char **)\00", align 1, !dbg !22
@.str.4 = private unnamed_addr constant [68 x i8] c"Couldn't allocate decrypted_msg bytes in eval_aesni256gcm_decrypt.c\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [87 x i8] c"decrypted_msg && \22Couldn't allocate decrypted_msg bytes in eval_aesni256gcm_decrypt.c\22\00", align 1, !dbg !33
@.str.6 = private unnamed_addr constant [65 x i8] c"Couldn't allocate ciphertext bytes in eval_aesni256gcm_decrypt.c\00", align 1, !dbg !38

!241 = !DILocalVariable(name: "encrypt_result", scope: !237, file: !2, line: 136, type: !131)
!242 = !DILocation(line: 136, column: 9, scope: !237)
!243 = !DILocation(line: 136, column: 56, scope: !237)
!244 = !DILocation(line: 137, column: 11, scope: !237)
!245 = !DILocation(line: 137, column: 16, scope: !237)
!246 = !DILocation(line: 137, column: 24, scope: !237)
!247 = !DILocation(line: 137, column: 41, scope: !237)
!248 = !DILocation(line: 137, column: 67, scope: !237)
!249 = !DILocation(line: 137, column: 74, scope: !237)
!250 = !DILocation(line: 136, column: 26, scope: !237)
!251 = !DILocation(line: 139, column: 15, scope: !252)
!252 = distinct !DILexicalBlock(scope: !237, file: !2, line: 139, column: 9)
!253 = !DILocation(line: 139, column: 12, scope: !252)
!254 = !DILocation(line: 140, column: 7, scope: !255)
!255 = distinct !DILexicalBlock(scope: !252, file: !2, line: 139, column: 31)
!256 = !DILocation(line: 141, column: 7, scope: !255)
!257 = !DILocalVariable(name: "_eval_cycles_low", scope: !258, file: !2, line: 145, type: !259)
!258 = distinct !DILexicalBlock(scope: !237, file: !2, line: 145, column: 18)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !116, line: 26, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !118, line: 42, baseType: !261)
!261 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!262 = !DILocation(line: 145, column: 18, scope: !258)
!263 = !DILocalVariable(name: "_eval_cycles_high", scope: !258, file: !2, line: 145, type: !259)
!264 = !{i64 2147804831, i64 2147804839, i64 2147804864, i64 2147804909, i64 2147804950}
!265 = !DILocation(line: 145, column: 16, scope: !237)
!266 = !DILocalVariable(name: "decrypt_result", scope: !237, file: !2, line: 148, type: !131)
!267 = !DILocation(line: 148, column: 9, scope: !237)
!268 = !DILocation(line: 148, column: 56, scope: !237)
!269 = !DILocation(line: 149, column: 17, scope: !237)
!270 = !DILocation(line: 149, column: 29, scope: !237)
!271 = !DILocation(line: 149, column: 44, scope: !237)
!272 = !DILocation(line: 149, column: 61, scope: !237)
!273 = !DILocation(line: 150, column: 11, scope: !237)
!274 = !DILocation(line: 150, column: 18, scope: !237)
!275 = !DILocation(line: 148, column: 26, scope: !237)
!276 = !DILocalVariable(name: "_eval_cycles_low", scope: !277, file: !2, line: 153, type: !259)
!277 = distinct !DILexicalBlock(scope: !237, file: !2, line: 153, column: 16)
!278 = !DILocation(line: 153, column: 16, scope: !277)
!279 = !DILocalVariable(name: "_eval_cycles_high", scope: !277, file: !2, line: 153, type: !259)
!280 = !{i64 2147805340, i64 2147805349, i64 2147805449, i64 2147805529, i64 2147805591}
!281 = !DILocation(line: 153, column: 14, scope: !237)
!282 = !DILocation(line: 155, column: 15, scope: !283)
!283 = distinct !DILexicalBlock(scope: !237, file: !2, line: 155, column: 9)
!284 = !DILocation(line: 155, column: 12, scope: !283)
!285 = !DILocation(line: 156, column: 7, scope: !286)
!286 = distinct !DILexicalBlock(scope: !283, file: !2, line: 155, column: 31)
!287 = !DILocation(line: 157, column: 7, scope: !286)
!288 = !DILocation(line: 160, column: 9, scope: !289)
!289 = distinct !DILexicalBlock(scope: !237, file: !2, line: 160, column: 9)
!290 = !DILocation(line: 160, column: 21, scope: !289)
!291 = !DILocation(line: 160, column: 18, scope: !289)
!292 = !DILocation(line: 161, column: 38, scope: !293)
!293 = distinct !DILexicalBlock(scope: !289, file: !2, line: 160, column: 33)
!294 = !DILocation(line: 161, column: 49, scope: !293)
!295 = !DILocation(line: 161, column: 47, scope: !293)
!296 = !DILocation(line: 161, column: 7, scope: !293)
!297 = !DILocation(line: 161, column: 13, scope: !293)
!298 = !DILocation(line: 161, column: 24, scope: !293)
!299 = !DILocation(line: 161, column: 22, scope: !293)
!300 = !DILocation(line: 161, column: 36, scope: !293)
!301 = !DILocation(line: 162, column: 5, scope: !293)
!302 = !DILocalVariable(name: "cmp_result", scope: !237, file: !2, line: 165, type: !131)
!303 = !DILocation(line: 165, column: 9, scope: !237)
!304 = !DILocation(line: 165, column: 29, scope: !237)
!305 = !DILocation(line: 165, column: 34, scope: !237)
!306 = !DILocation(line: 165, column: 49, scope: !237)
!307 = !DILocation(line: 165, column: 22, scope: !237)
!308 = !DILocation(line: 166, column: 14, scope: !309)
!309 = distinct !DILexicalBlock(scope: !237, file: !2, line: 166, column: 9)
!310 = !DILocation(line: 166, column: 11, scope: !309)
!311 = !DILocation(line: 167, column: 7, scope: !312)
!312 = distinct !DILexicalBlock(scope: !309, file: !2, line: 166, column: 26)
!313 = !DILocation(line: 168, column: 7, scope: !312)
!314 = !DILocation(line: 170, column: 3, scope: !237)
!315 = !DILocation(line: 129, column: 60, scope: !230)
!316 = !DILocation(line: 129, column: 3, scope: !230)
!317 = distinct !{!317, !235, !318, !319}
!318 = !DILocation(line: 170, column: 3, scope: !226)
!319 = !{!"llvm.loop.mustprogress"}
!320 = !DILocalVariable(name: "ccounts_out", scope: !128, file: !2, line: 172, type: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !323, line: 7, baseType: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !325, line: 49, size: 1728, elements: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !342, !344, !345, !346, !349, !351, !353, !357, !360, !362, !365, !368, !369, !370, !373, !374}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !324, file: !325, line: 51, baseType: !131, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !324, file: !325, line: 54, baseType: !111, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !324, file: !325, line: 55, baseType: !111, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !324, file: !325, line: 56, baseType: !111, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !324, file: !325, line: 57, baseType: !111, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !324, file: !325, line: 58, baseType: !111, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !324, file: !325, line: 59, baseType: !111, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !324, file: !325, line: 60, baseType: !111, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !324, file: !325, line: 61, baseType: !111, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !324, file: !325, line: 64, baseType: !111, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !324, file: !325, line: 65, baseType: !111, size: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !324, file: !325, line: 66, baseType: !111, size: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !324, file: !325, line: 68, baseType: !340, size: 64, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !325, line: 36, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !324, file: !325, line: 70, baseType: !343, size: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !324, file: !325, line: 72, baseType: !131, size: 32, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !324, file: !325, line: 73, baseType: !131, size: 32, offset: 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !324, file: !325, line: 74, baseType: !347, size: 64, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !118, line: 152, baseType: !348)
!348 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !324, file: !325, line: 77, baseType: !350, size: 16, offset: 1024)
!350 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !324, file: !325, line: 78, baseType: !352, size: 8, offset: 1040)
!352 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !324, file: !325, line: 79, baseType: !354, size: 8, offset: 1048)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 1)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !324, file: !325, line: 81, baseType: !358, size: 64, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !325, line: 43, baseType: null)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !324, file: !325, line: 89, baseType: !361, size: 64, offset: 1152)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !118, line: 153, baseType: !348)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !324, file: !325, line: 91, baseType: !363, size: 64, offset: 1216)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !325, line: 37, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !324, file: !325, line: 92, baseType: !366, size: 64, offset: 1280)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !325, line: 38, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !324, file: !325, line: 93, baseType: !343, size: 64, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !324, file: !325, line: 94, baseType: !112, size: 64, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !324, file: !325, line: 95, baseType: !371, size: 64, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !372, line: 18, baseType: !119)
!372 = !DIFile(filename: "build/lib/clang/22/include/__stddef_size_t.h", directory: "/home/rgangar/Documents/llvm-data-independent-timing", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !324, file: !325, line: 96, baseType: !131, size: 32, offset: 1536)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !324, file: !325, line: 98, baseType: !375, size: 160, offset: 1568)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 20)
!378 = !DILocation(line: 172, column: 9, scope: !128)
!379 = !DILocation(line: 172, column: 29, scope: !128)
!380 = !DILocation(line: 172, column: 23, scope: !128)
!381 = !DILocation(line: 173, column: 10, scope: !128)
!382 = !DILocation(line: 173, column: 22, scope: !128)
!383 = !DILocation(line: 173, column: 30, scope: !128)
!384 = !DILocation(line: 173, column: 3, scope: !128)
!385 = !DILocation(line: 176, column: 11, scope: !128)
!386 = !DILocation(line: 178, column: 4, scope: !128)
!387 = !DILocation(line: 178, column: 14, scope: !128)
!388 = !DILocation(line: 176, column: 3, scope: !128)
!389 = !DILocalVariable(name: "ii", scope: !390, file: !2, line: 179, type: !131)
!390 = distinct !DILexicalBlock(scope: !128, file: !2, line: 179, column: 3)
!391 = !DILocation(line: 179, column: 12, scope: !390)
!392 = !DILocation(line: 179, column: 8, scope: !390)
!393 = !DILocation(line: 179, column: 20, scope: !394)
!394 = distinct !DILexicalBlock(scope: !390, file: !2, line: 179, column: 3)
!395 = !DILocation(line: 179, column: 25, scope: !394)
!396 = !DILocation(line: 179, column: 23, scope: !394)
!397 = !DILocation(line: 179, column: 3, scope: !390)
!398 = !DILocation(line: 180, column: 12, scope: !399)
!399 = distinct !DILexicalBlock(scope: !394, file: !2, line: 179, column: 41)
!400 = !DILocation(line: 180, column: 42, scope: !399)
!401 = !DILocation(line: 180, column: 48, scope: !399)
!402 = !DILocation(line: 180, column: 4, scope: !399)
!403 = !DILocation(line: 181, column: 3, scope: !399)
!404 = !DILocation(line: 179, column: 35, scope: !394)
!405 = !DILocation(line: 179, column: 3, scope: !394)
!406 = distinct !{!406, !397, !407, !319}
!407 = !DILocation(line: 181, column: 3, scope: !390)
!408 = !DILocation(line: 182, column: 17, scope: !128)
!409 = !DILocation(line: 182, column: 10, scope: !128)
!410 = !DILocation(line: 182, column: 30, scope: !128)
!411 = !DILocation(line: 182, column: 37, scope: !128)
!412 = !DILocation(line: 182, column: 3, scope: !128)
!413 = !DILocation(line: 191, column: 3, scope: !128)
