; ModuleID = 'eval_ed25519.c'
source_filename = "eval_ed25519.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [119 x i8] c"Usage: %s <num_benchmark_iterations> <num_warmup_iterations> <message> <cycle_counts_file> [<dynamic_hitcounts_file>]\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"Error initializing lib sodium\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [125 x i8] c"(sodium_init_success == sodium_init_result || sodium_already_initd == sodium_init_result) && \22Error initializing lib sodium\22\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [15 x i8] c"eval_ed25519.c\00", align 1, !dbg !17
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [23 x i8] c"int main(int, char **)\00", align 1, !dbg !22
@.str.4 = private unnamed_addr constant [53 x i8] c"Couldn't allocate opened_msg bytes in eval_ed25519.c\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [69 x i8] c"opened_msg && \22Couldn't allocate opened_msg bytes in eval_ed25519.c\22\00", align 1, !dbg !33
@.str.6 = private unnamed_addr constant [53 x i8] c"Couldn't allocate signed msg bytes in eval_ed25519.c\00", align 1, !dbg !38
@.str.7 = private unnamed_addr constant [62 x i8] c"msg && \22Couldn't allocate signed msg bytes in eval_ed25519.c\22\00", align 1, !dbg !40

!221 = !DILocalVariable(name: "cur_iter", scope: !222, file: !2, line: 109, type: !131)
!222 = distinct !DILexicalBlock(scope: !128, file: !2, line: 109, column: 3)
!223 = !DILocation(line: 109, column: 12, scope: !222)
!224 = !DILocation(line: 109, column: 8, scope: !222)
!225 = !DILocation(line: 109, column: 26, scope: !226)
!226 = distinct !DILexicalBlock(scope: !222, file: !2, line: 109, column: 3)
!227 = !DILocation(line: 109, column: 37, scope: !226)
!228 = !DILocation(line: 109, column: 48, scope: !226)
!229 = !DILocation(line: 109, column: 46, scope: !226)
!230 = !DILocation(line: 109, column: 35, scope: !226)
!231 = !DILocation(line: 109, column: 3, scope: !222)
!232 = !DILocalVariable(name: "_eval_unused", scope: !233, file: !2, line: 112, type: !131)
!233 = distinct !DILexicalBlock(scope: !226, file: !2, line: 109, column: 72)
!234 = !DILocation(line: 112, column: 9, scope: !233)
!235 = !DILocation(line: 112, column: 56, scope: !233)
!236 = !DILocation(line: 112, column: 74, scope: !233)
!237 = !DILocation(line: 112, column: 24, scope: !233)
!238 = !DILocalVariable(name: "_eval_cycles_low", scope: !239, file: !2, line: 115, type: !240)
!239 = distinct !DILexicalBlock(scope: !233, file: !2, line: 115, column: 18)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !116, line: 26, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !118, line: 42, baseType: !242)
!242 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!243 = !DILocation(line: 115, column: 18, scope: !239)
!244 = !DILocalVariable(name: "_eval_cycles_high", scope: !239, file: !2, line: 115, type: !240)
!245 = !{i64 2147803302, i64 2147803310, i64 2147803335, i64 2147803380, i64 2147803421}
!246 = !DILocation(line: 115, column: 16, scope: !233)
!247 = !DILocalVariable(name: "sign_result", scope: !233, file: !2, line: 118, type: !131)
!248 = !DILocation(line: 118, column: 9, scope: !233)
!249 = !DILocation(line: 118, column: 55, scope: !233)
!250 = !DILocation(line: 120, column: 20, scope: !233)
!251 = !DILocation(line: 121, column: 19, scope: !233)
!252 = !DILocation(line: 122, column: 23, scope: !233)
!253 = !DILocation(line: 118, column: 23, scope: !233)
!254 = !DILocalVariable(name: "_eval_cycles_low", scope: !255, file: !2, line: 125, type: !240)
!255 = distinct !DILexicalBlock(scope: !233, file: !2, line: 125, column: 16)
!256 = !DILocation(line: 125, column: 16, scope: !255)
!257 = !DILocalVariable(name: "_eval_cycles_high", scope: !255, file: !2, line: 125, type: !240)
!258 = !{i64 2147803800, i64 2147803809, i64 2147803909, i64 2147803989, i64 2147804051}
!259 = !DILocation(line: 125, column: 14, scope: !233)
!260 = !DILocation(line: 127, column: 15, scope: !261)
!261 = distinct !DILexicalBlock(scope: !233, file: !2, line: 127, column: 9)
!262 = !DILocation(line: 127, column: 12, scope: !261)
!263 = !DILocation(line: 128, column: 7, scope: !264)
!264 = distinct !DILexicalBlock(scope: !261, file: !2, line: 127, column: 28)
!265 = !DILocation(line: 129, column: 7, scope: !264)
!266 = !DILocation(line: 132, column: 9, scope: !267)
!267 = distinct !DILexicalBlock(scope: !233, file: !2, line: 132, column: 9)
!268 = !DILocation(line: 132, column: 21, scope: !267)
!269 = !DILocation(line: 132, column: 18, scope: !267)
!270 = !DILocation(line: 133, column: 38, scope: !271)
!271 = distinct !DILexicalBlock(scope: !267, file: !2, line: 132, column: 33)
!272 = !DILocation(line: 133, column: 49, scope: !271)
!273 = !DILocation(line: 133, column: 47, scope: !271)
!274 = !DILocation(line: 133, column: 7, scope: !271)
!275 = !DILocation(line: 133, column: 13, scope: !271)
!276 = !DILocation(line: 133, column: 24, scope: !271)
!277 = !DILocation(line: 133, column: 22, scope: !271)
!278 = !DILocation(line: 133, column: 36, scope: !271)
!279 = !DILocation(line: 134, column: 5, scope: !271)
!280 = !DILocalVariable(name: "open_result", scope: !233, file: !2, line: 137, type: !131)
!281 = !DILocation(line: 137, column: 9, scope: !233)
!282 = !DILocation(line: 137, column: 40, scope: !233)
!283 = !DILocation(line: 138, column: 12, scope: !233)
!284 = !DILocation(line: 138, column: 24, scope: !233)
!285 = !DILocation(line: 138, column: 39, scope: !233)
!286 = !DILocation(line: 137, column: 23, scope: !233)
!287 = !DILocation(line: 139, column: 14, scope: !288)
!288 = distinct !DILexicalBlock(scope: !233, file: !2, line: 139, column: 9)
!289 = !DILocation(line: 139, column: 11, scope: !288)
!290 = !DILocation(line: 140, column: 7, scope: !291)
!291 = distinct !DILexicalBlock(scope: !288, file: !2, line: 139, column: 27)
!292 = !DILocation(line: 141, column: 7, scope: !291)
!293 = !DILocation(line: 143, column: 3, scope: !233)
!294 = !DILocation(line: 109, column: 60, scope: !226)
!295 = !DILocation(line: 109, column: 3, scope: !226)
!296 = distinct !{!296, !231, !297, !298}
!297 = !DILocation(line: 143, column: 3, scope: !222)
!298 = !{!"llvm.loop.mustprogress"}
!299 = !DILocalVariable(name: "ccounts_out", scope: !128, file: !2, line: 146, type: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !302, line: 7, baseType: !303)
!302 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !304, line: 49, size: 1728, elements: !305)
!304 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !321, !323, !324, !325, !328, !330, !332, !336, !339, !341, !344, !347, !348, !349, !352, !353}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !303, file: !304, line: 51, baseType: !131, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !303, file: !304, line: 54, baseType: !111, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !303, file: !304, line: 55, baseType: !111, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !303, file: !304, line: 56, baseType: !111, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !303, file: !304, line: 57, baseType: !111, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !303, file: !304, line: 58, baseType: !111, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !303, file: !304, line: 59, baseType: !111, size: 64, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !303, file: !304, line: 60, baseType: !111, size: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !303, file: !304, line: 61, baseType: !111, size: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !303, file: !304, line: 64, baseType: !111, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !303, file: !304, line: 65, baseType: !111, size: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !303, file: !304, line: 66, baseType: !111, size: 64, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !303, file: !304, line: 68, baseType: !319, size: 64, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !304, line: 36, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !303, file: !304, line: 70, baseType: !322, size: 64, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !303, file: !304, line: 72, baseType: !131, size: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !303, file: !304, line: 73, baseType: !131, size: 32, offset: 928)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !303, file: !304, line: 74, baseType: !326, size: 64, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !118, line: 152, baseType: !327)
!327 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !303, file: !304, line: 77, baseType: !329, size: 16, offset: 1024)
!329 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !303, file: !304, line: 78, baseType: !331, size: 8, offset: 1040)
!331 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !303, file: !304, line: 79, baseType: !333, size: 8, offset: 1048)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 1)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !303, file: !304, line: 81, baseType: !337, size: 64, offset: 1088)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !304, line: 43, baseType: null)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !303, file: !304, line: 89, baseType: !340, size: 64, offset: 1152)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !118, line: 153, baseType: !327)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !303, file: !304, line: 91, baseType: !342, size: 64, offset: 1216)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !304, line: 37, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !303, file: !304, line: 92, baseType: !345, size: 64, offset: 1280)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !304, line: 38, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !303, file: !304, line: 93, baseType: !322, size: 64, offset: 1344)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !303, file: !304, line: 94, baseType: !112, size: 64, offset: 1408)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !303, file: !304, line: 95, baseType: !350, size: 64, offset: 1472)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !351, line: 18, baseType: !119)
!351 = !DIFile(filename: "build/lib/clang/22/include/__stddef_size_t.h", directory: "/home/rgangar/Documents/llvm-data-independent-timing", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !303, file: !304, line: 96, baseType: !131, size: 32, offset: 1536)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !303, file: !304, line: 98, baseType: !354, size: 160, offset: 1568)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 20)
!357 = !DILocation(line: 146, column: 9, scope: !128)
!358 = !DILocation(line: 146, column: 29, scope: !128)
!359 = !DILocation(line: 146, column: 23, scope: !128)
!360 = !DILocation(line: 147, column: 10, scope: !128)
!361 = !DILocation(line: 147, column: 22, scope: !128)
!362 = !DILocation(line: 147, column: 30, scope: !128)
!363 = !DILocation(line: 147, column: 3, scope: !128)
!364 = !DILocation(line: 149, column: 11, scope: !128)
!365 = !DILocation(line: 151, column: 4, scope: !128)
!366 = !DILocation(line: 151, column: 14, scope: !128)
!367 = !DILocation(line: 149, column: 3, scope: !128)
!368 = !DILocalVariable(name: "ii", scope: !369, file: !2, line: 152, type: !131)
!369 = distinct !DILexicalBlock(scope: !128, file: !2, line: 152, column: 3)
!370 = !DILocation(line: 152, column: 12, scope: !369)
!371 = !DILocation(line: 152, column: 8, scope: !369)
!372 = !DILocation(line: 152, column: 20, scope: !373)
!373 = distinct !DILexicalBlock(scope: !369, file: !2, line: 152, column: 3)
!374 = !DILocation(line: 152, column: 25, scope: !373)
!375 = !DILocation(line: 152, column: 23, scope: !373)
!376 = !DILocation(line: 152, column: 3, scope: !369)
!377 = !DILocation(line: 153, column: 12, scope: !378)
!378 = distinct !DILexicalBlock(scope: !373, file: !2, line: 152, column: 41)
!379 = !DILocation(line: 153, column: 42, scope: !378)
!380 = !DILocation(line: 153, column: 48, scope: !378)
!381 = !DILocation(line: 153, column: 4, scope: !378)
!382 = !DILocation(line: 154, column: 3, scope: !378)
!383 = !DILocation(line: 152, column: 35, scope: !373)
!384 = !DILocation(line: 152, column: 3, scope: !373)
!385 = distinct !{!385, !376, !386, !298}
!386 = !DILocation(line: 154, column: 3, scope: !369)
!387 = !DILocation(line: 155, column: 17, scope: !128)
!388 = !DILocation(line: 155, column: 10, scope: !128)
!389 = !DILocation(line: 155, column: 30, scope: !128)
!390 = !DILocation(line: 155, column: 37, scope: !128)
!391 = !DILocation(line: 155, column: 3, scope: !128)
!392 = !DILocation(line: 164, column: 3, scope: !128)
